In [2]:
import pandas as pd
import re

In [3]:
text = "a23b"

In [8]:
num= re.search("\d\d", text)
print(num.group())

23

In [13]:
text="4pm"
nondeci=re.search("\D\D", text)

In [14]:
print (nondeci.group())

pm

In [20]:
text='My Phone number is 5055552356'
num= re.search("\d"*10, text)
print(num.group())

5055552356

In [23]:
text='My Phone number is 5055552356'
num= re.search("(\d\d\d)(\d\d\d)(\d\d\d\d)", text)
print(num.group(1))

505

In [28]:
value="0 1 t 10, o 100. 100000"
output= re.findall("\d{1,6}", value)
output

['0', '1', '10', '100', '100000']

In [31]:
phone="2004-959-559 # this is phone number"
output=re.sub("\D","",phone)
output

'2004959559'

In [62]:
s=pd.Series(["a32","b4434","c51654"])
s

0       a32
1     b4434
2    c51654
dtype: object

In [66]:
s.str.extract("(\d{1,10})")

       0
0     32
1   4434
2  51654

In [43]:
s= pd.Series(["s2dfb","v4rthr","c5dthdh"])
s.str.extract("(\w)\d(\w\w)")

   0   1
0  s  df
1  v  rt
2  c  dt

In [44]:
s= pd.Series(['40 l/100 km (comb)', '38 l/100 km (comb)', '6.4 l/100 km (comb)',
       '8.3 kg/100 km (comb)', '5.1 kg/100 km (comb)',    '5.4 l/100 km (comb)', '6.7 l/100 km (comb)',
       '6.2 l/100 km (comb)', '7.3 l/100 km (comb)',
       '6.3 l/100 km (comb)', '5.7 l/100 km (comb)',
       '6.1 l/100 km (comb)', '6.8 l/100 km (comb)',
       '7.5 l/100 km (comb)', '7.4 l/100 km (comb)',
       '3.6 kg/100 km (comb)', '0 l/100 km (comb)', 
       '7.8 l/100 km (comb)'])

In [53]:
result=s.str.extract('(\d\d|\d.\d|\d)')
result

      0
0    40
1    38
2   6.4
3   8.3
4   5.1
5   5.4
6   6.7
7   6.2
8   7.3
9   6.3
10  5.7
11  6.1
12  6.8
13  7.5
14  7.4
15  3.6
16    0
17  7.8